
punctuations = [':', '،', '.', ')', '(', '}', '{', '؟', '!', '-', '/', '؛', '#', '*', '\n', '\"',
                ']', '[', '«', '»', '٪', '+', '٠', '\\', '\"', '_', '\'']
escape = ['\u200c', '\u200b', '\u200f']
numbers = ['۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹']
englsih_chars = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
                 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
englsih_numbers = ['0', '1', '2', '3', '4',
                   '5', '6', '7', '8', '9', '%', '@', '_', "\"", '$', '&', ',', '"', '>', '<', '|',
                   '­', ';', 'é', '=', '+', '?']
post_fix = ['ات', 'ترین', 'تر', 'هایی', 'های', 'ها', 'ان', 'ای', 'ی']
pre_fix = ['بی']

past_stem = ['رفت', 'کرد', 'خورد', 'داشت', 'گذاشت', 'ساخت', 'برداشت', 'ایستاد', 'گفت', 'نوشت', 'شنید', 'داد', 'آمد',
             'شمرد', 'آورد', 'خواست', 'دید', 'شناخت', 'گرفت', 'نشست']
past_pronoun = ['م', 'ی', '', 'یم', 'ید', 'ند']
present_stem = ['رو', 'کن', 'خور', 'دار', 'گذار', 'ساز', 'بردار', 'ایست', 'گو', 'نویس', 'شنو', 'ده', 'ا', 'شمار', 'آور',
                'خواه', 'بین', 'شناس', 'گیر', 'نشین']
present_pronoun = ['م', 'ی', 'د', 'یم', 'ید', 'ند']
multi_form = {'جزیی': 'جزئی', 'هیئت': 'هیأت', 'مسؤل': 'مسئول', 'سوییس': 'سوئیس', 'امریکا': 'آمریکا', 'بلیط': 'بلیت',
              'تزیین': 'تزئین'
    , 'آزوقه': 'آذوقه', 'قران': 'قرآن', 'دگمه': 'دکمه', 'جزییات': 'جزئیات', 'جزائر': 'جزایز', 'اهدا': 'اهداء',
              'خلا': 'خلاء'
    , 'آیینه': 'آینه'}

arabic_irregular_plural = {'قوانین': 'قانون', 'جرایز': 'جزیره', 'فوائد': 'فایده', 'آثار': 'اثر', 'اسامی': 'اسم',
                           'حوادث': 'حادثه', 'رسوم': 'رسم', 'عبارات': 'عبارت', 'سوانح': 'سانحه', 'اوامر': 'امر',
                           'جوانب': 'جانب', 'روابط': 'رابطه', 'عناصر': 'عنصر', 'تصاویر': 'تصویر', 'تجارب': 'تجربه',
                           'ادیان': 'دین', 'اخبار': 'خبر', 'افکار': 'فکر', 'اعیاد': 'عید', 'منابع': 'منبع'}